; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument7 image1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(pointing satellite2 GroundStation2)
	(have_image Star5 thermograph0)
	(have_image Star6 image1)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon9 image1)
))

)

; plan
1. (turn_to satellite3 groundstation2 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 groundstation2)
   goals met: 1 of 6
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 6
3. (calibrate satellite3 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 1 of 6
4. (turn_to satellite3 phenomenon9 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon9)
   goals met: 1 of 6
5. (take_image satellite3 phenomenon9 instrument6 image1)
   added: (have_image phenomenon9 image1)
   goals met: 2 of 6
6. (turn_to satellite3 phenomenon8 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon8)
   goals met: 2 of 6
7. (take_image satellite3 phenomenon8 instrument6 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 3 of 6
8. (turn_to satellite3 phenomenon7 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 phenomenon7)
   goals met: 3 of 6
9. (take_image satellite3 phenomenon7 instrument6 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 4 of 6
10. (turn_to satellite3 star5 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star5)
   goals met: 4 of 6
11. (take_image satellite3 star5 instrument6 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 5 of 6
12. (turn_to satellite3 star6 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star6)
   goals met: 5 of 6
13. (take_image satellite3 star6 instrument6 image1)
   added: (have_image star6 image1)
   goals met: 6 of 6
